const gender = {
    "เพศชาย":0,
    "เพศหญิง":1,
    "เพศทางเลือก":2
}

const grade = {
    "ม.1":7,
    "ม.2":8,
    "ม.3":9,
    "ม.4":10,
    "ม.5":11,
    "ม.6":12
}

const subject = {
    "คณิตศาสตร์":"MTH",
    "ภาษาไทย":"THA",
    "วิทยศาตร์":"SCI",
    "ฟิสิกส์":"PHY",
    "เคมี":"CHM",
    "ชีววิทยา":"BIO",
    "สัมคมศึกษา":"SOC",
    "ภาษาอังกฤษ":"ENG"
}

const dateOfWeek = {
    "ไม่ระบุวัน":0,
    "วันอาทิตย์":1,
    "วันจันทร์":2,
    "วันอังคาร":3,
    "วันพุธ":4,
    "วันพฤหัสบดี":5,
    "วันศุกร์":6,
    "วันเสาร์":7
}

export const defaultValue = {
    gender,
    grade,
    subject,
    dateOfWeek
}