import React, { Fragment } from "react";
import { Typography, Grid,Row} from "antd";
import style from "../styles.module.scss";
const { Title } = Typography;
const { useBreakpoint } = Grid;

export default function CoinDetail() {
  const screens = useBreakpoint();

  return (
    <Fragment>
      <div className={screens.md ? null : style.subProfile}>
        <Title level={screens.md ? 3 : 5}>รายละเอียดเกี่ยวกับเหรียญ</Title>
        <Row>
            1.)เหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญ
            เหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญ <br></br>
            1.)เหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญ
            เหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญ<br></br>
            1.)เหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญ
            เหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญ<br></br>
            1.)เหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญ
            เหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญ<br></br>
            1.)เหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญ
            เหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญเหรียญ
        </Row>
      </div>
    </Fragment>
  );
}
